{
  "FixCursorHold.nvim": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "barbar.nvim": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lua": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "conform.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "git-blame.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "go.nvim": { "branch": "master" },
  "gruvbox.nvim": { "branch": "main" },
  "guihua.lua": { "branch": "master" },
  "image.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lspkind.nvim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason-tool-installer.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neotest": { "branch": "master" },
  "neotest-go": { "branch": "main" },
  "neotest-jest": { "branch": "main" },
  "neotest-plenary": { "branch": "master" },
  "neotest-python": { "branch": "master" },
  "neotest-vim-test": { "branch": "master" },
  "neotest-vitest": { "branch": "main" },
  "nerdcommenter": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dap-virtual-text": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "ollama.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "popup.nvim": { "branch": "master" },
  "rainbow_csv": { "branch": "master" },
  "telescope-live-grep-args.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-sort-motion": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-unimpaired": { "branch": "master" },
  "vim-vue": { "branch": "master" },
  "which-key.nvim": { "branch": "main" }
}
