tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/fonts"
tap "caskroom/cask"

# Basic
brew "coreutils"
brew "curl"
brew "wget"
brew "gawk"
brew "imagemagick"
brew "jq"
brew "nmap"
brew "tree"
brew "pandoc"

# Lua with luajit
brew "lua"
brew "luajit"

# Python2 + Python3
brew "python@2"
brew "python"
brew "cmake"

# Ruby version manager
brew "rbenv"

# Programming
brew "editorconfig"
brew "shellcheck"
brew "yarn", args: ["without-node"]

# MacVim (not the terminal version)
brew "cscope"
brew "macvim", args: ["HEAD", "with-lua", "with-luajit", "with-python@2", "with-python3", "with-cscope"]

# Golang
brew "glide"
brew "go"
brew "hugo"

# Tmux
brew "tmux"
brew "reattach-to-user-namespace" # for copy from tmux to mac namespace
brew "gnupg" # for secure emailing

# ZSH shell
brew "zsh"

# GPG suite
brew "gnupg"
