tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts" # Nerd Fonts

# Basic
brew "coreutils"
brew "bash"
brew "curl"
brew "wget"
brew "gawk"
brew "imagemagick"
brew "jq"
brew "git"
brew "nmap"
brew "tree"
brew "pandoc"
brew "k9s"
brew "helm"
brew "kubectx"
brew "minikube"
brew "kubernetes-cli", link: false

brew "awscli"
brew "svgo"
brew "go"
brew "golang-migrate" # go migrations
brew "editorconfig"
brew "neovim"
brew "vim"
brew "fd" # nvim telescope
brew "wrk" # measure http sever speed (req/res)
brew "git-delta" # helps with better visual diff the content
brew "mutt" # console email client
brew "awk" # for advance search & test manupulation
brew "ffmpeg" # for video
brew "parallel" # concurrent tasks
brew "rename" # Perl-powered file rename script with many helpful built-ins

# GPG - to signed your commits
brew "gnutls"
brew "pinentry"
brew "pinentry-mac"
brew "gnupg"

# Support
brew "lua"
brew "luajit"
brew "luarocks"
brew "python@3.9"
brew "rbenv" # Ruby version manager
brew "pyenv" # Python version manager

# Linters, parsers & formatters
brew "stylua" # lua formatter
brew "hadolint" # lint Dockerfiles
brew "jsonlint"
brew "luacheck"
brew "prettier"
brew "rustfmt"
brew "shellcheck"
brew "yamlfmt"
brew "yamllint"

# Usibility
brew "podman"

# Productivity
brew "ansible"
brew "sshpass"
cask "yed" # diagramming editor
cask "amethyst"
cask "dbeaver-community" # sql editor
cask "font-hack"
brew "watch"
cask "lens"
brew "fzf"
brew "cscope"
brew "macvim" # MacVim (not the terminal version)
brew "ripgrep"
brew "ansible" # managing multiple servers
cask "caffeine" # prevent system from going to sleep
brew "ollama"
brew "audacity"
brew "scroll-reverser" # when using trackball & mousepad
brew "keycastr" # to show key inputs on screen
brew "pdfgrep" # allow to search in pdf files
brew "asitop" # monitor CPU, RAM, proceses on screen
brew "stats" # ui widget showing CPU, RAM in top navigation bar
brew "mysql-client" # install mysql, mysqldump + other helper programs

# Browsers
cask "google-chrome"
cask "brave-browser"
cask "firefox"

# Tmux
brew "tmux"
brew "reattach-to-user-namespace" # for copy from tmux to mac namespace

# Others
brew "cmake"
brew "gobject-introspection"
brew "harfbuzz"
brew "libheif"
brew "unbound"
brew "guile"
brew "librsvg"
brew "pango"
brew "nghttp2"

# Networking
cask "wireshark" # UI app

# Utils
brew "insect" # calculate lot
brew "onefetch" # git project summary
brew "task" # task manager
brew "yt-dlp" # download vid/audio
brew "cookiecutter" # templating engine
brew "progress" # show progress of cp, mv, dd
brew "difftastic" # show structural diff
brew "usql" # universal cli interface for SQL
brew "jesseduffield/lazydocker/lazydocker" # TUI for managing docker cotainers

# vi: ft=ruby
