tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts" # Nerd Fonts

# Basic
brew "coreutils"
brew "bash"
brew "curl"
brew "wget"
brew "gawk"
brew "imagemagick"
brew "jq"
brew "git"
brew "nmap"
brew "tree"
brew "pandoc"
brew "k9s"
brew "helm"
brew "kubectx"
brew "kubernetes-cli", link: false
brew "awscli"
brew "minikube"
brew "shellcheck"
brew "svgo"
brew "jsonlint"
brew "go"
brew "golang-migrate" # go migrations
brew "editorconfig"
brew "neovim"
brew "vim"

# GPG - to signed your commits
brew "gnutls"
brew "pinentry"
brew "pinentry-mac"
brew "gnupg"

# Support
brew "lua"
brew "luajit"
brew "python@3.9"
brew "rbenv" # Ruby version manager

# Productivity
cask "amethyst"
cask "font-hack"
brew "watch"
cask "lens"
brew "fzf"
brew "cscope"
brew "macvim" # MacVim (not the terminal version)
brew "ripgrep"

# Tmux
brew "tmux"
brew "reattach-to-user-namespace" # for copy from tmux to mac namespace

# Others
brew "cmake"
brew "gobject-introspection"
brew "harfbuzz"
brew "libheif"
brew "unbound"
brew "guile"
brew "librsvg"
brew "pango"
brew "nghttp2"
